app/controllers/tweets_controller.rb

  def index
    @tweets = Tweet.includes(:user)
---
SELECT `tweets`.* FROM `tweets`
SELECT `users`.* FROM `users` WHERE `users`.`id` IN (3, 1)

  def create
    Tweet.create( text: tweet_params[:text], user_id: current_user.id)
---
INSERT INTO `tweets` (`name`, `text`, `created_at`, `updated_at`, `user_id`) VALUES ('rrrrrr', 'outotuotu', '2019-01-05 06:06:58', '2019-01-05 06:06:58', 3)

  def destroy
    tweet = Tweet.find(params[:id])
    if tweet.user_id == current_user.id
      tweet.destroy
---
SELECT  `tweets`.* FROM `tweets` WHERE `tweets`.`id` = 7 LIMIT 1
DELETE FROM `tweets` WHERE `tweets`.`id` = 7

  def edit
    @tweet = Tweet.find(params[:id])
---
SELECT  `tweets`.* FROM `tweets` WHERE `tweets`.`id` = 1 LIMIT 1

  def update
    tweet = Tweet.find(params[:id])
      if tweet.user_id == current_user.id
        tweet.update(tweet_params)
---
SELECT  `tweets`.* FROM `tweets` WHERE `tweets`.`id` = 2 LIMIT 1
UPDATE `tweets` SET `text` = 'uuuuuu', `updated_at` = '2019-01-05 06:53:19' WHERE `tweets`.`id` = 2